Repository: XianYuLauncher/XianYuLauncher
Catalog: XianYuLauncher/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn, zh_tw

# 联机大厅Page_RoomNumberLabel.Text
source: Room Number
zh_cn: 房间号

# 联机大厅Page_HostLabel
source: Host
zh_cn: 房主

# 联机大厅Page_GuestLabel
source: Guest
zh_cn: 房客

# 联机大厅Page_EasyTierLabel
source: EasyTier Version
zh_cn: EasyTier版本

# 联机Page_FindingRoomTitle
source: Looking for room
zh_cn: 正在寻找房间

# 联机Page_StopButton
source: Stop
zh_cn: 停止

# 联机Page_InputRoomIdTitle
source: Enter Room ID
zh_cn: 输入房间号

# 联机Page_RoomIdPlaceholder
source: Enter the room ID your friend sent you
zh_cn: 输入朋友发给你的房间号

# 联机Page_ConfirmButton
source: Confirm
zh_cn: 确认

# 联机Page_CancelButton
source: Cancel
zh_cn: 取消

# 联机Page_RoomNotFoundError
source: Room not found or closed
zh_cn: 房间不存在或已关闭

# 联机Page_JoinFailedError
source: Failed to join room, please try again later
zh_cn: 连接房间失败，请稍后重试

# 联机Page_TerracottaNotFoundError
source: Terracotta executable not found, please check if terracotta-windows-x86_64.exe exists in plugins\Terracotta directory
zh_cn: 联机服务文件不存在，请检查plugins\Terracotta目录下是否有terracotta-windows-x86_64.exe文件

# 联机Page_GettingStatusText
source: Getting status...
zh_cn: 正在获取状态...

# 联机Page_ScanningStatusSetText
source: Scanning status set, starting polling...
zh_cn: 已设置为查询状态，开始轮询...

# 联机Page_ScanningStatusFailedText
source: Failed to set scanning status: {0}
zh_cn: 设置查询状态失败: {0}

# 联机Page_ScanningStatusErrorText
source: Error setting scanning status: {0}
zh_cn: 设置查询状态时发生错误: {0}

# 联机Page_PollingFailedText
source: Request failed: {0}
zh_cn: 请求失败: {0}

# 联机Page_NetworkErrorText
source: Network error: {0}
zh_cn: 网络错误: {0}

# 联机Page_ErrorText
source: Error: {0}
zh_cn: 错误: {0}

# 联机Page_PollingContent.Text
source: Please start Minecraft, select 'Open to LAN' option, then run the multiplayer service
zh_cn: 请启动Minecraft,选择 对局域网开放 选项，然后运行联机服务即可

# 联机Page_PollingResultLabel.Text
source: Polling Result:
zh_cn: 轮询结果:

# ModDownloadDetailPage_DownloadDialog_PrimaryButtonText.Content
source: Select Version
zh_cn: 选择版本

# ModDownloadDetailPage_DownloadDialog_SecondaryButtonText.Content
source: Custom Location
zh_cn: 自定义位置

# ModDownloadDetailPage_DownloadDialog_CloseButtonText.Content
source: Cancel
zh_cn: 取消

# ModDownloadDetailPage_DownloadDialog_InstructionText.Text
source: Please select download method:
zh_cn: 请选择下载方式：

# ModDownloadDetailPage_VersionSelectionDialog_Title.Title
source: Select Game Version
zh_cn: 选择游戏版本

# ModDownloadDetailPage_VersionSelectionDialog_PrimaryButtonText.Content
source: Confirm
zh_cn: 确认

# ModDownloadDetailPage_VersionSelectionDialog_CloseButtonText.Content
source: Cancel
zh_cn: 取消

# ModDownloadDetailPage_VersionSelectionDialog_InstructionText.Text
source: Please select the game version to install:
zh_cn: 请选择要安装的游戏版本：

# ModDownloadDetailPage_SaveSelectionDialog_Title.Title
source: Select Save
zh_cn: 选择存档

# ModDownloadDetailPage_SaveSelectionDialog_PrimaryButtonText.Content
source: Confirm
zh_cn: 确认

# ModDownloadDetailPage_SaveSelectionDialog_CloseButtonText.Content
source: Cancel
zh_cn: 取消

# ModDownloadDetailPage_SaveSelectionDialog_InstructionText.Text
source: Please select the save to install the datapack:
zh_cn: 请选择要安装数据包的存档：

# ModDownloadDetailPage_ModpackInstallDialog_Title.Title
source: Modpack Installing
zh_cn: 整合包安装中

# ModDownloadDetailPage_ModpackInstallDialog_CloseButtonText.Content
source: Cancel
zh_cn: 取消

# ModDownloadDetailPage_QuickInstallGameVersionDialog_Title.Title
source: Select Game Version
zh_cn: 选择游戏版本

# ModDownloadDetailPage_QuickInstallGameVersionDialog_InstructionText.Text
source: Please select the game version to install the mod:
zh_cn: 请选择要安装Mod的游戏版本：

# ModDownloadDetailPage_QuickInstallGameVersionDialog_Tip.Text
source: Gray versions are not supported by this mod
zh_cn: 灰色版本表示当前Mod不支持该版本

# ModDownloadDetailPage_QuickInstallModVersionDialog_Title.Title
source: Select Mod Version
zh_cn: 选择Mod版本

# LaunchPage_AddedProfilesText
source: Added Profiles
zh_cn: 已添加角色

# Settings_RealTimeLogs.Text
source: Launch Game Real-time Log
zh_cn: 启动游戏实时日志

# Settings_FontFamily.Text
source: Font
zh_cn: 字体

# ErrorAnalysis_Title.Text
source: Real-time Game Log
zh_cn: 实时游戏日志

# ErrorAnalysis_AnalysisTitle.Text
source: XianYu Fixer
zh_cn: 崩溃分析

# ErrorAnalysis_NoErrorInfo.Text
source: No analysis content because Minecraft hasn't crashed yet...
zh_cn: 没有分析内容,因为Minecraft还没崩溃...

# ErrorAnalysis_Analyzing.Text
source: Analyzing the crash reason...
zh_cn: 正在分析崩溃原因...

# 联机Page_DownloadingTerracottaTitle
source: Downloading Terracotta Plugin
zh_cn: 正在下载陶瓦插件

# 联机Page_DownloadingTerracottaMessage
source: Downloading and installing Terracotta plugin, please wait...
zh_cn: 正在下载并安装Terracotta插件，请稍候...

# ErrorAnalysis_AnalysisComplete.Text
source: Analysis completed.
zh_cn: 分析完成。

# ErrorAnalysis_AnalysisCanceled.Text
source: Analysis canceled.
zh_cn: 分析已取消。

# ErrorAnalysis_RequestFailed.Text
source: Analysis request failed: {0}
zh_cn: 分析请求失败: {0}

# ErrorAnalysis_AnalysisFailed.Text
source: Analysis failed: {0}
zh_cn: 分析失败: {0}

# ProfilePage_Title.Text
source: Profile Management
zh_cn: 角色管理

# ProfilePage_Subtitle.Text
source: Manage your Minecraft profiles
zh_cn: 管理您的Minecraft角色

# ProfilePage_AddedProfilesText.Text
source: Added Profiles
zh_cn: 已添加的角色

# ProfilePage_AddAccountButton.ToolTipService.ToolTip
source: Add Account
zh_cn: 添加账户

# ProfilePage_AddAccountText.Text
source: Add Account
zh_cn: 添加账户

# ProfilePage_OfflineLoginMenuItem.Text
source: Offline Login
zh_cn: 离线登录

# ProfilePage_MicrosoftLoginMenuItem.Text
source: Microsoft Login
zh_cn: 微软登录

# ProfilePage_ExternalLoginMenuItem.Text
source: External Login
zh_cn: 外置登录

# ProfilePage_ExternalLoginDialog_Title
source: External Login
zh_cn: 外置登录

# ProfilePage_ExternalLoginDialog_AuthServerLabel
source: Auth Server
zh_cn: 认证服务器

# ProfilePage_ExternalLoginDialog_UsernameLabel
source: Username
zh_cn: 用户名

# ProfilePage_ExternalLoginDialog_PasswordLabel
source: Password
zh_cn: 密码

# ProfilePage_ExternalLoginDialog_ConfirmButton
source: Confirm
zh_cn: 确定

# ProfilePage_ExternalLoginDialog_CancelButton
source: Cancel
zh_cn: 取消

# ProfilePage_ExternalLoginDialog_SelectProfileTitle
source: Select Profile
zh_cn: 选择角色

# ProfilePage_ExternalLoginDialog_SelectProfileInstruction
source: Please select the profile to add:
zh_cn: 请选择要添加的角色：

# ProfilePage_ProfileType_External
source: External Login
zh_cn: 外置登录

# ProfilePage_ProfileTypeLabel.Text
source: Profile Type:
zh_cn: 角色类型:

# ProfilePage_EmptyProfilesTitle.Text
source: No profiles added yet
zh_cn: 还没有添加任何角色

# ProfilePage_EmptyProfilesDescription.Text
source: Click the 'Add Account' button to add your first profile
zh_cn: 点击'添加账户'按钮开始添加您的第一个角色

# ProfileManagementPage_CurrentProfileLabel.Text
source: Current Profile
zh_cn: 当前角色

# ProfileManagementPage_RenameTitle.Text
source: Rename
zh_cn: 改名

# ProfileManagementPage_OfflineOnlyNote.Text
source: Only available for offline profiles
zh_cn: 仅对离线角色启用

# ProfileManagementPage_NewUsernameTextBox.PlaceholderText
source: Enter new username
zh_cn: 输入新用户名

# ProfileManagementPage_SaveUsernameButton.Content
source: Save
zh_cn: 保存

# ProfileManagementPage_ChangeUuidTitle.Text
source: Change UUID
zh_cn: 修改UUID

# ProfileManagementPage_NewUuidTextBox.PlaceholderText
source: Enter new UUID
zh_cn: 输入新UUID

# ProfileManagementPage_SaveUuidButton.Content
source: Save
zh_cn: 保存

# ProfileManagementPage_SetSkinTitle.Text
source: Set Skin
zh_cn: 设置皮肤

# ProfileManagementPage_SkinUploadNote.Text
source: Upload or select new skin
zh_cn: 上传或选择新皮肤

# ProfileManagementPage_BrowseSkinButton.Content
source: Browse Skin Files
zh_cn: 浏览皮肤文件

# ProfileManagementPage_SetCapeTitle.Text
source: Set Cape
zh_cn: 设置披风

# ProfileManagementPage_CapeSelectionNote.Text
source: Select cape for current account
zh_cn: 选择当前账号的披风

# ProfileManagementPage_CapeComboBox.PlaceholderText
source: Select cape
zh_cn: 选择披风

# ProfileManagementPage_ApplyCapeButton.Content
source: Apply Selected Cape
zh_cn: 应用所选披风

# ProfileManagementPage_SkinTeachingTip.Title
source: Skin Information
zh_cn: 皮肤信息

# ProfileManagementPage_SkinTeachingTip.Subtitle
source: Detailed information about the current skin
zh_cn: 当前皮肤的详细信息

# ProfileManagementPage_SkinModelLabel.Text
source: Applicable Model:
zh_cn: 适用的模型:

# ProfileManagementPage_SaveSkinButton.Content
source: Save Skin Texture
zh_cn: 保存皮肤纹理

# ProfilePage_SwitchProfileButton.ToolTipService.ToolTip
source: Switch to this profile
zh_cn: 切换到该角色

# ProfilePage_DeleteProfileButton.ToolTipService.ToolTip
source: Delete profile
zh_cn: 删除角色

# ProfilePage_OfflineProfileText
source: Offline Profile
zh_cn: 离线角色

# ProfilePage_MicrosoftProfileText
source: Microsoft Account
zh_cn: 微软账户

# ProfilePage_RenewTokenMenuItem.Text
source: Renew Token
zh_cn: 续签令牌

# Settings_CacheManagement.Text
source: Cache Management
zh_cn: 缓存管理

# Settings_TotalCacheSize.Text
source: Total Cache Size
zh_cn: 总缓存大小

# Settings_SearchCacheSize.Text
source: Search Results Cache
zh_cn: 搜索结果缓存

# Settings_ImageCacheSize.Text
source: Image Cache
zh_cn: 图片缓存

# Settings_VersionCacheSize.Text
source: Version List Cache
zh_cn: 版本列表缓存

# LaunchPage_LauncherChangelog.Text
source: XianYu Launcher Changelog
zh_cn: XianYu Launcher 更新日志

# LaunchPage_ModRecommendation.Text
source: Mod Recommendation:
zh_cn: Mod推荐：

# Settings_SelectCommunityDownloadSource.Text
source: Community Resource Download Source
zh_cn: 社区资源下载源

# Settings_UpdateSettings.Text
source: Update Settings
zh_cn: 更新设置

# Settings_AutoUpdateCheck.Text
source: Auto Update Check
zh_cn: 自动检查更新

# ProfileManagementPage_Skin3DPreviewTitle.Text
source: Skin 3D Preview
zh_cn: 皮肤3D预览

# ProfileManagementPage_Skin3DPreviewNote.Text
source: 3D skin model preview, supports rotation and zoom
zh_cn: 3D皮肤模型预览，支持旋转和缩放

# ProfileManagementPage_DefaultSkinTitle.Text
source: Default Skins
zh_cn: 默认皮肤

# ProfileManagementPage_SaveButton.Text
source: Save
zh_cn: 保存

# TutorialPage_LoginType_Microsoft.Content
source: Microsoft Account
zh_cn: 微软账号

# TutorialPage_LoginType_Offline.Content
source: Offline Mode
zh_cn: 离线模式
